<a href="https://colab.research.google.com/github/nirmalaraj77/SQL/blob/main/SQL_Notes_DataCamp.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**EXERCISE 1**
##Count unique titles released 1990 to 1999 (inclusive) in English with rating of 'G', 'PG' or 'PG-13'

SELECT COUNT (DISTINCT title) AS nineties_english_films_for_teens  
FROM films  
WHERE (release_year BETWEEN 1990 AND 1999)  
AND language = 'English'  
AND (certification IN ('G', 'PG', 'PG-13'));  

<br>


#**EXERCISE 2**
##Which release_year had the most language diversity?

SELECT release_year, COUNT (DISTINCT language) AS dist_language  
FROM films  
GROUP BY release_year  
ORDER BY dist_language DESC;  

<br>

#**EXERCISE 3**
##Find the average budget and gross earnings for films each year after 1990 if the average budget is greater than 60 million

SELECT release_year, AVG(budget) AS avg_budget, AVG(gross) AS avg_gross  
FROM films  
WHERE release_year > 1990  
GROUP BY release_year  
HAVING AVG(budget) > 60000000  
ORDER BY avg_gross DESC  
LIMIT 1;    

<br>

#**EXERCISE 4**
##Determine the average gross domestic product (GDP) per capita by region in 2010
SELECT region, AVG(gdp_percapita) AS avg_gdp  
FROM countries AS c  
LEFT JOIN economies AS e  
USING(code)  
WHERE year = 2010   
GROUP BY region  
ORDER by avg_gdp DESC  
LIMIT 10 ;  

<br>

#**EXERCISE 5**
##Determine top 10 capital cities in Europe and Americas by city_perc, a percentage that calculates the "proper" population in a city as a percentage of the total population in the wider metro area, as follows:     city_proper_pop / metroarea_pop * 100
-- Select fields from cities  
SELECT DISTINCT name, country_code, city_proper_pop, metroarea_pop, city_proper_pop / metroarea_pop * 100 AS city_perc  
FROM cities  
-- Use subquery to filter city name  
WHERE name IN  
(SELECT capital  
FROM countries  
WHERE continent LIKE '%Europe'  
OR continent LIKE '%America')  
-- Add filter condition such that metroarea_pop does not have null values  
AND metroarea_pop IS NOT NULL  
-- Sort and limit the result  
ORDER BY city_perc DESC  
LIMIT 10 ;

#**NOTE**
##Alter Column Data Type
ALTER TABLE books   
ALTER COLUMN date_text SET DATA TYPE date   
USING to_date(date_text, 'mm-dd-yyyy');

<br>

##Alter Column Name
Alter table existing_table_name  
RENAME COLUMN old_column_name TO new_column_name;

<br>

##Insert Data into Table
INSERT INTO table_name (column1, column2, column3, ...)  
VALUES (value1, value2, value3, ...);

<br>

##Delete View in Database
DROP VIEW [view_name] ;

#**SQL DATABASES**
### - Have Schema
### - Have Unique Identifier(s)
### - Queries output Result Sets
### - Field names must be Underscored and small_letters
### - Field names with punctuation, capitalization or spaces must be quoted "  "
### - KEYWORDS are capitalised
### - New lines, Capitalisation and Indentation not required
### - **[Holywell's SQL Style Guide](https://www.sqlstyle.guide/)**

<br>

#**Debugging SQL**
### - Code not pocessed in written order
### - Misspelling
### - Incorrect capitalisation
### - Incorrect or missing punctuation, comma errors

#**SQL Execution Order**

### - **Written Code**
SELECT

FROM 

WHERE

GROUP BY

HAVING 

ORDER BY

LIMIT

### - **Execution Order**
FROM

WHERE

GROUP BY

HAVING 

SELECT (alias defined here)

ORDER BY

LIMIT

#**SQL DATA TYPES**
### - VARCHAR
### - INT
### - FLOAT
### - NUMERIC
### - BINARY (images and fingerprints etc.)

#**SQL QUERY KEYWORDS**

##SELECT
##SELECT * (SELECT ALL)
##SELECT AS (aliasing)
##FROM
##LIMIT (Postgres) = TOP (SQL Server)

#**VIEW**
### - CREATE VIEW AS (virtual table - stores query code)
### - Views update sutomatically
### - No result set when creating a view
### - Query view (same as table) by selecting FROM the view

### - Create View
CREATE VIEW employee_hire_years AS  
SELECT id, name, year_hired  
FROM employees; 


### - Query View
SELECT id, name  
FROM employee_hire_years;

#**DISTINCT**
### - Combines data into unique values in a field
### - Use DISTINCT on multiple fields by writing DISTINCT first

SELECT DISTINCT author, genre  
FROM books;

#**COUNT( )**
### - COUNT ( ) includes only non-missing values, same as IS NOT NULL
##3 - COUNT (*) includes missing values
### - Use Alias to make result more readable

### E.g. 
SELECT COUNT (birthdate) AS count_birthdates  
FROM people;


### - E.g. 
SELECT COUNT (name) AS count_names,   
COUNT (birthdate) AS count_birthdates    
FROM people;


### - E.g. 
SELECT COUNT (*) AS total_records    
FROM people;

#**COUNT, DISTINCT**
### - Count unique values

### - E.g. 
SELECT COUNT (DISTINCT bithdate) AS count_disctinct_birthdates  
FROM people;

#**WHERE**
### - Filter SQL Query
### - Use Comparision operators >, >=, <, <=, =, <>

### - E.g. >
SELECT title    
FROM films    
WHERE release_year > 1960;  

### - E.g. =  
SELECT title  
FROM films  
WHERE release_year = 1960;

### - E.g. < > not equal to
SELECT title  
FROM films  
WHERE release_year <> 1960;

### - E.g. '  ' for Strings
SELECT title, country  
FROM films  
WHERE country = 'Japan';

#**COUNT, WHERE**
##**Count unique values**

### - E.g. 
SELECT COUNT (num_votes) AS films_over_1000K_votes  
FROM reviews  
WHERE num_votes > 100000;

### - E.g. 
SELECT COUNT (language) AS count_spanish  
FROM films  
WHERE language = 'Spanish'

#**MULTIPLE CRITERIA KEYWORDS**
### - Put multiple clauses in brackets

##**OR**
WHERE color = 'yellow' OR colour = 'red'

##**AND**
WHERE (language = 'German')AND (release_year > 2000 AND release_year < 2010)

##**AND, OR**
WHERE (release_year = 1994 OR release_year = 1995) AND (certification = 'PG' OR certification = 'R')

##**BETWEEN (inclusive), AND**
WHERE release_year BETWEEN 1994 AND 2000

##**BETWEEN, AND, OR**
WHERE release_year BETWEEN 1994 AND 2000 AND country ='UK'

##**WHERE, AND, OR, BETWEEN**
WHERE (release_year = 1990 OR release_year = 1999)  
AND (language = 'English' OR language = 'Spanish')  
AND gross > 2000000


### - E.g.
WHERE (release_year BETWEEN 1990 AND 2000)  
AND budget > 100000000  
AND (language = 'Spanish' OR language = 'French')

#**IN**
### - Combine multiple OR Keywords
WHERE release_year = 1920 OR release_year = 1930 OR release_year = 1940 

can be combined as  

WHERE release_year IN (1920, 1930, 1940)

#**FILTER TEXT KEYWORDS**
### - Filter patterns with wildcards %, _ anywhere
### - Case sensitive

##**LIKE**

### - Percent % matches 0, 1 or many characters
### - E.g. Find names starting with 'Ade'
SELECT name  
FROM people  
WHERE name LIKE 'Ade%';  

###**Underscore_  matches single characters** 
### - E.g. Find names starting with 'Ev' or 3rd character 't'
SELECT name  
FROM people  
WHERE name LIKE 'Ev_' OR name like __t%

##**NOT LIKE**
### - E.g. (find names with third character not 't') and does not start with 'A.'
SELECT name  
FROM people  
WHERE name NOT LIKE '__t%'   
AND name NOT LIKE 'A.%' ;

#**IS NULL (Missing or unknown value)**
### - COUNT ( ) includes only non-missing values, same as IS NOT NULL
### - COUNT (*) includes missing values

### - E.g. 
SELECT name  
FROM people  
WHERE birthdate IS NULL ;  

### - E.g. 
SELECT COUNT (*) AS no_birthdates    
FROM people  
WHERE birthdate IS NULL ;  


#**IS NOT NULL**
### - E.g. 
SELECT COUNT (*) AS count_bithdates   
FROM people  
WHERE birthdate IS NOT NULL ;

#**AGGREGATE FUNCTIONS**
### - Data summarised with function name ON COLUMNS
### - Must use Aliasing

##**AVG ( )**

##**SUM ( )**

##**MIN ( )**

##**MAX ( )**

##**COUNT ( )**

### Mathematical
SELECT SUM (budget)  
FROM films ;

### - Non-Mathematical
SELECT MIN (country)  
FROM films ;

#**WHERE, AGGREGATE FUNCTIONS**
SELECT AVG (budget) AS avg_budget  
FROM films  
WHERE release_year >= 2000 ;

#**ROUND ( )**
### - Two parameters, number_to_round and decimal_places
### - Decimal place optional - default is 0
### - Can use negative to round before decimal point
SELECT ROUND (AVG (budget), 2) AS avg_budget  
FROM films  
WHERE release_year >= 2010;

#**ARITHMETIC and ALIASING**
### - Data calculated on Fields
### - Can Use Arithmetic Operators
### - Always use alias

### - E.g.
SELECT (1 + 1)  
SELECT (3 - 1)  
SELECT (3 * 4)  
SELECT (4 / 3 ) *answer is 1 (int)*  
SELECT (4.0 / 3.0) *use floats for precise answers*
<br>

SELECT (num_user + num_critics) AS num_user_critic  
FROM reviews ;

#**ORDER BY ASC**
#**ORDER BY DESC**

### - Sorting results
### - Can use Alias
### - Can use multiple fields after order by

### - E.g.
SELECT title, release_year, budget, gross  
FROM films
WHERE budget IS NOT NULL  
ORDER BY budget ASC, gross DESC ;

#**COUNT, GROUP BY, ORDER BY**

### - Group, Calculate and Order results
### - Use after FROM and before any other Keyword
### - Can refer to alias
### - Used with Aggregate Functions
### - Reduces non-grouped field to 1 record 
### - Must correspond to 1 group
### - All SELECT columns must appear in the GROUP BY clause or used in Aggregate Function
#### - Order affects how data is grouped


### - E.g. (GROUP BY single field)
SELECT certification, COUNT (title) AS title_count  
FROM films  
GROUP BY certification ;

### - E.g. (GROUP BY multiple fields)
SELECT certification, language, COUNT (title) AS title_count  
FROM films  
GROUP BY certification, language ;

### - E.g. 
SELECT certification, COUNT (title) AS title-count  
FROM films  
GROUP BY certification  
ORDER BY title_count DESC ;

### - E.g. 
SELECT release_year, AVG(duration) AS avg_duration  
FROM films  
GROUP BY release_year  
ORDER BY release_year ;

### - E.g. 
SELECT release_year, country, MAX(budget) AS max_budget  
FROM films  
GROUP BY release_year, country  
ORDER BY release_year, country ;

#**HAVING**

### - Filter grouped results
### - Cannot filter Aggregate Functions with WHERE
### - WHERE filters individual records vs HAVING filters group records
### - Cannot use Alias

### - E.g. 
SELECT release_year, COUNT (title) AS title_count  
FROM films  
GROUP BY release_year  
HAVING COUNT(title) > 10 ;

### - E.g. 
SELECT certification, COUNT (title) AS title_count  
FROM films  
WHERE certification IN ('G', 'PG', 'PG-13')  
GROUP BY certification  
HAVING COUNT (title) > 100  
ORDER BY title_count DESC  
LIMIT 10;

### - E.g. In what years average film duration over 2 hours?
SELECT release_year  
FROM films 
GROUP BY release_year
HAVING AVG(duration) > 120 ;

### - E.g. Which countries have the most varied film certifications?
SELECT country, COUNT (DISTINCT certification) AS certification_count  
FROM films  
GROUP BY country  
HAVING COUNT (DISTINCT certification) > 10 ;  

### - E.g. What countries have the highest average film budgets?
SELECT country, ROUND(AVG(budget), 2) AS average_budget  
FROM films  
GROUP BY country  
HAVING AVG(budget) > 1000000000  
ORDER BY average_budget DESC ;

#**ADDITIVE JOINS**
### - Adds columns to left_table
### - Fields with different names are added to result set with original names
### - Fields with same name are added as duplicate columns with same name
### - Tables must have uniqe identifier key field(s)
### - Can join with unique key or any other field
### - Table names can be Aliased
### - Fades out fields that do not match critea
### - Must use table.column_name to prevent SQL ambiguity error
### - Create query with join first and select fields later
### - Use **ON** Keyword OR and = to match unique fields with different names
### - Use **USING ( )** Keyword to join same field names

<br>

#**JOIN (INNER JOIN)**
### - Joins records in left and right tables matching specified field(s)

### - E.g. Countries with both presidents and prime-ministers  
SELECT prime_ministers.country, prime_ministers.continent, prime_minister, 
president  
FROM prime_ministers  
INNER JOIN presidents  
ON prime_ministers.country = presidents.country ;


### - E.g. Countries with both presidents and prime-ministers (tables aliased)
SELECT p1.country, p1.continent, prime_minister, president    
FROM prime_ministers AS p1   
INNER JOIN presidents AS p2  
ON p1.country = p2.country ;

<br>

### - E.g. Countries with both presidents and prime-ministers (USING keyword)
SELECT p1.country, p1.continent, prime_minister, president      
FROM prime_ministers AS p1   
INNER JOIN presidents AS p2  
USING (country) ;

#**SQL RELATIONSHIPS**
### - One-to-many - Single entity associalted with several entities (artists, authors)
### - One-to-one - Unique pairings between entities (fingerprints)
### - Many-to-many - Several entities associated with several entities (languages and countries
### - Put most relevant result on far left
### - Results are ordered by left table column by default
### - Change by using ORDER BY

<br>

### - E.g. Query all different languages spoken in a country
SELECT c.name AS country, l.name AS language  
FROM countries AS c  
INNER JOIN languages AS l
USING (code)  
ORDER BY country ASC ;


### - E.g. How is this different from querying all countries speaking each language
SELECT l.name AS language, c.name AS country  
FROM countries AS c  
INNER JOIN languages AS l
USING(code)  
ORDER BY language ASC;

#**MULTIPLE JOINS**
### - Join on joins
### - Chain inner joins to result of previous inner joins
### - Additional joins link to left_table
### - Left_table or right_table can be used in ON clause

### - Syntax
SELECT *  
FROM left_table  
INNER JOIN right_table  
ON left_table.id = right_table.id  
INNER Join another_table  
ON left_table.id = another_table.id ;


### - E.g. Countries with both presidents and prime-ministers and when prime ministers came into office

SELECT p1.country, p1.continent, p2.president, p1.prime_minister, p3.pm_start  
FROM prime_ministers AS p1  
INNER JOIN presidents AS p2  
USING (country)  
INNER JOIN prime_minister_terms AS p3  
USING (prime_minister);

#**JOINING ON MULTIPLE KEYS**

### - Each value in field being joined on left_table does not always correspond to exactly one record in the joining field on right_table
### - Add **AND** Keyword to **ON** clause to limit the records returned

### - Syntax
SELECT *  
FROM left_table  
INNER JOIN right_table  
ON left_table.id1 = right_table.id1   
AND left_table.id2 = right_table.id2 ; 

### - E.g. Relationship between fertility and unemployment rates. Join tables to return country name, year, fertility rate and unemployment rate from the countries, populations and economies tables.
SELECT name, e.year, p.fertility_rate, e.unemployment_rate  
FROM countries AS c  
INNER JOIN populations AS p  
ON c.code = p.country_code  
INNER JOIN economies AS e  
ON c.code = e.code   
AND p.year = e.year ;

#**LEFT JOIN (LEFT OUTER JOIN)**

### - All records reytained from left_table, only matching records retained from right_table

### - E.g. All countries with prime ministers and presidents if any
SELECT p1.country, president, prime_minister  
FROM prime_ministers AS p1  
LEFT JOIN presidents AS p2  
USING (country) ;


#**RIGHT JOIN (RIGHT OUTER JOIN)**

### - Is not common
### - RIGHT JOIN can be recoded as LEFT JOIN
### - All records retained from right_table, only matching records shown from left_table

### - Syntax
SELECT *  
FROM left_table  
RIGHT JOIN right_table  
ON left_table.id = right_table.id ;  


#**FULL JOIN (FULL OUTER JOIN)**

### - Join all records on left_table and right_table 
### - Does not fade out null values
### - Order of table matters
### - Do not specify common field from particular table in order to populate result w/o nulls

### - E.g. All countries with presidents and / or prime ministers
SELECT country, president, prime_minister  
FROM prime_ministers AS p1  
FULL JOIN presidents AS p2  
USING (country) ;  

#**CROSS JOIN**
### - Creates all possible combinations of two tables

### - E.g. Meetings of prime ministersin Asia with presidents in South America
SELECT prime_minister, president  
FROM prime_ministers AS p1  
CROSS JOIN presidents AS p2
WHERE p1.continent = 'Asia'  
AND p2.continent = South America ;


#**SELF JOIN**

### - Joins table with itself (to compare parts of same table)
### - Must use Aliasing
### - MUST choose joining field carefully
### - No dedicated syntax, use other joins
### - Use AND, OR clauses and calculations / exclusions to eliminate unwanted / duplicate results

### - E.g, Prime minsters meet with other primi ministers on same continents
SELECT p1.country AS country1,   
p2.country AS country2,   
p1.continent     
FROM prime_ministers AS p1  
INNER JOIN prime_ministers as p2  
ON p1.continent = p2.continent 
AND p1.country <> p2.country ;


### - E.g. Compare population growth
SELECT  
p1.country_code,   
p1.size AS size2010,   
p2.size AS size2015  
FROM populations AS p1  
INNER JOIN populations AS p2
ON p1.country_code = p2.country_code
WHERE p1.year = 2010  
AND p1.year =  p2.year - 5;

#**UNION and UNION ALL**
### - Set Operations Theory for SQL Joins
### - UNION returns single record if two or more records are identical
### - UNION ALL returns all records including duplicates
### - Number of selected columns and data types must be identical
### - Result will be combined under selected or aliased filed names from left query
### - Do not require field(s) to join
### - Does not select and compare but stacks
### - Taks 2 tables and returns all records


### - Syntax
SELECT *   
FROM left_table  
UNION (ALL)  
SELECT *  
FROM right_table ;

### - E.g. Prime ministers meet monarchs (Prime ministers and monarchs will be combined under leader, even though only monarch is aliased as leader)
### - UNION shows countries once where monarchs is also pm
### - UNION ALL gives 2 results for countries where monarch also pm 
SELECT monarch AS leader, country  
FROM monarchs   
UNION (ALL)   
SELECT prime_minister, country  
FROM prime_ministers  
ORDER BY country, leader ;  

#**INTERSECT**
### - Taks 2 tables and returns only records that exist in both tables
### - Syntax
SELECT id, val   
FROM left_table  
INTERSECT   
SELECT id, val
FROM right_table ;

### - E.g. Countries with prime_minsters and presidents
SELECT country AS intersect_country  
FROM prime_ministers  
INTERSECT  
SELECT country  
FROM presidents ;

### - E.g. Intersect on two fields - Countries with prime ministers and monarchs
SELECT country, prime_minister AS leader  
FROM prime_ministers  
INTERSECT  
SELECT country, monarch  
FROM monarchs ;


#**EXCEPT**
### - Identify records from left_table not present in right_table
### - Matched whole records
### - E.g. Monarchs who are not prime ministers
SELECT monarch, country   
FROM monarchs
EXCEPT    
SELECT prime_minister, country   
FROM prime_ministers ;

#**SUBQUERIES INSIDE WHERE**

### - Semi joins and Anti joins
### - Nested SQL Queries
### - Use filter functions
### - No new columns added (vs Additive Joins)
### - Subquery result must be same data type as the filter

### - Syntax:
SELECT *  
FROM some_table  
WHERE some_field IN (NOT IN)  
  (include subquery here) ;


#**SEMI JOIN**
### - Chooses records in left_table where condition is met in right_table
### - Returns all values of col1_left_table where the values are present in col2_right_table

### - E.g. Presidents of countries that gained independenc before 1800
SELECT country, continent, president  
FROM presidents   
WHERE country IN    
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


### - E.g. Identify languages spoken in the Middle East
SELECT DISTINCT name  
FROM languages  
WHERE code IN  
   (SELECT code  
   FROM countries  
   WHERE region = 'Middle East')  
ORDER BY name;  


#**ANTI JOIN**
### - Returns all values of col1_left_table where the values are NOT present in col2_right_table

### - E.g. Presidents of countries in the Americas that were founded after 1800
SELECT country, continent, president  
FROM presidents   
WHERE continent LIKE '%America'  
AND country **NOT IN**  
(SELECT country  
   FROM states  
   WHERE indep_year < 1800) ;  


### - E.g. Identify currencies of Oceanian countries (countries not in the currencies tble)
SELECT code, name  
FROM countries  
WHERE continent = 'Oceania'    
AND code NOT IN  
   (SELECT code  
   FROM currencies);

#**SUBQUERIES INSIDE WHERE, SELECT**
### - Subquery requires Alias


### - E.g. Count number of monarchs in monarchs table listed for each continent in states table
SELECT DISTINCT continent,  
  (SELECT COUNT (*)  
  FROM monarchs    
  WHERE states.continent = monarchs.continent) AS monarch_count  
  FROM states ;


### - E.g. Which countries had high average life expectancies in 2015 (> 1.15 times avg)
SELECT *  
FROM populations  
WHERE life_expectancy > 1.15 *  
  (SELECT AVG(life_expectancy)  
   FROM populations  
   WHERE year = 2015)   
     AND year = 2015;


### - E.g. Return the name, country_code and urbanarea_pop for all capital cities (not aliased)
SELECT name, country_code, urbanarea_pop  
FROM cities  
WHERE name IN  
  (SELECT capital
   FROM countries)
ORDER BY urbanarea_pop DESC;


#**Join vs Subquery**

### - E.g. Select the nine countries with the most cities appearing in the cities table

### - Left Join Method
SELECT countries.name AS country, COUNT(*) AS cities_num  
FROM countries  
LEFT JOIN cities  
ON countries.code = cities.country_code  
GROUP BY country  
ORDER BY cities_num DESC, country  
LIMIT 9;

### - Subquery Method
SELECT countries.name AS country,  
  (SELECT COUNT (*)   
  FROM cities  
  WHERE cities.country_code = countries.code) AS cities_num  
FROM countries  
ORDER BY cities_num DESC, country  
LIMIT 9;

#**SUBQUERY INSIDE FROM**
### - Add multiple statements to FROM by adding comma,
### - Include subquery as temporary table in FROM clause and SELECT from it
### - Returns Deplicates, drop by using DISTINCT
### - *Subquery field names do not have to match*


### - Syntax
SELECT left_table.id, left_val
FROM left_table, right_table
WHERE left_table.id = right_table.id ;

### - E.g. All continents with monarchs and most recent country to gain independence in that continent
SELECT DISTINCT monarchs.continent, sub.most_recent
FROM monarchs,   
(SELECT continent, MAX (indep_year) AS most_recent  
FROM states  
GROUP BY continent) AS sub    
WHERE monarchs.continent = sub.continent  
ORDER BY continent ;

### - E.g. Determining number of languages spoken for each country with the country's local_name, which is a field only present in the countries table and not in the languages table  
SELECT DISTINCT local_name, sub.lang_num    
FROM countries,     
  (SELECT code, COUNT(*) AS lang_num  
  FROM languages    
  GROUP BY code) AS sub   
WHERE countries.code = sub.code  
ORDER BY lang_num DESC ;  

### - E.g. Determine unemployment rate for countries in 2015. Not interested in countries with "Republic" or "Monarchy" as their form of government
SELECT code, inflation_rate, unemployment_rate  
FROM economies  
WHERE year = 2015    
AND code NOT IN    
 (SELECT code  
 FROM countries  
 WHERE gov_form LIKE '%Monarchy%'   
 OR gov_form LIKE '%Republic%')  
ORDER BY inflation_rate;

#**CASE STATEMENTS**

### - WHEN, THEN, ELSE, END (AS)

### - Syntax
CASE WHEN x = 1 THEN 'a'  
     WHEN x = 2 THEN 'b'  
     ELSE 'c' END AS new_column  

### - E.g. CASE statements comparing column values
SELECT  
-- Select the date of the match  
date,    
-- Identify home wins, losses, or ties  
CASE WHEN home_goal > away_goal THEN 'Home win!'  
     WHEN home_goal < away_goal THEN 'Home loss :('   
     ELSE 'Tie' END AS outcome  
FROM matches_spain;

### - E.g. CASE statements comparing two column values part 2
SELECT    
m.date,  
t.team_long_name AS opponent,  
CASE WHEN m.home_goal < m.away_goal THEN 'Barcelona win!'  
     WHEN m.home_goal > m.away_goal THEN 'Barcelona loss :('   
     ELSE 'Tie' END AS outcome  
FROM matches_spain AS m    
-- Join teams_spain to matches_spain  
LEFT JOIN teams_spain AS t   
ON m.hometeam_id = t.team_api_id  
WHERE m.awayteam_id = 8634;

#**COMPLEX CASE STATEMENTS**

### - WHEN, THEN, ELSE, NULL, END (AS)
### - Use multiple CASE statements (creates multiple columns)
### - Add multiple logical conditions to WHEN clause
### - Add specific filters to WHERE clause to control exclusions
### - Use ELSE NULL 
### - Filter entire CASE statement as a Column by incluing CASE statement without Alias in WHERE and choose what to include or exclude

### - E.g. Filter by team_api_id
SELECT date, home_team_api_id, away_team_api_id,   
CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
     ELSE 'Loss or Tie :('   
END AS outcome  
FROM match  
WHERE home_team_api_id = 8455 OR away_team_api_id = 8455 ;

### - E.g. Filter entire CASE statement (don't ALIAS statement in  WHERE)
SELECT *  
FROM table  
WHERE  
CASE WHEN a > 5 THEN 'Keep'  
     WHEN a <= 5 THEN 'Exclude' END = 'Keep';  

### - E.g. Filter entire CASE statement (don't ALIAS statement in  WHERE)
SELECT date, season,   
CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
END AS outcome  
FROM match  
WHERE CASE WHEN home_team_api_id = 8455 AND home_team_goal > away_team_goal  
          THEN 'Chelsea Home Win!'  
     WHEN away_team_api_id = 8455 AND home_team_goal < away_team_goal    
          THEN 'Chelsea Away Win!'  
END IS NOT NULL ;